[
  {
    "id": 1,
    "category": "Morning Azkar",
    "categoryArabic": "أذكار الصباح",
    "zikr": "أَصْبَـحْنا وَأَصْبَـحَ المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
    "translation": "We have reached the morning and at this very time all sovereignty belongs to Allah. All praise is for Allah. There is no deity except Allah, the One. He has no partner. To Him belongs sovereignty and all praise. He has power over all things. O Lord, I ask You for the goodness within this day and the goodness after it and I take refuge in You from the evil within this day and the evil after it. O Lord, I take refuge in You from laziness and helplessness. O Lord, I take refuge in You from punishment in the Fire and punishment in the grave.",
    "transliteration": "Aṣbaḥnā wa aṣbaḥa-l-mulku li-llāh, wa-l-ḥamdu li-llāh. Lā ilāha illa-llāh waḥdahu lā sharīka lah. Lahu-l-mulku wa lahu-l-ḥamd, wa huwa ʿalā kulli shayʾin qadīr. Rabbi asʾaluka khayra mā fī hādhā-l-yawm wa khayra mā baʿdah, wa aʿūdhu bika min sharri mā fī hādhā-l-yawm wa sharri mā baʿdah. Rabbi aʿūdhu bika min al-kasali wa sūʾi-l-kibar. Rabbi aʿūdhu bika min ʿadhābin fī-n-nār wa ʿadhābin fī-l-qabr.",
    "reference": "Sahih Muslim 4/2088",
    "count": "1",
    "description": "Recite in the morning for daily protection",
    "benefits": "Protection from evil throughout the day"
  },
  {
    "id": 2,
    "category": "Evening Azkar",
    "categoryArabic": "أذكار المساء",
    "zikr": "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلَةِ وَشَرِّ ما بَعْـدَهـا، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
    "translation": "We have reached the evening and at this very time all sovereignty belongs to Allah. All praise is for Allah. There is no deity except Allah, the One. He has no partner. To Him belongs sovereignty and all praise. He has power over all things. O Lord, I ask You for the goodness within this night and the goodness after it and I take refuge in You from the evil within this night and the evil after it. O Lord, I take refuge in You from laziness and helplessness. O Lord, I take refuge in You from punishment in the Fire and punishment in the grave.",
    "transliteration": "Amsaynā wa amsā-l-mulku li-llāh, wa-l-ḥamdu li-llāh. Lā ilāha illa-llāh waḥdahu lā sharīka lah. Lahu-l-mulku wa lahu-l-ḥamd, wa huwa ʿalā kulli shayʾin qadīr. Rabbi asʾaluka khayra mā fī hādhihi-l-laylah wa khayra mā baʿdahā, wa aʿūdhu bika min sharri mā fī hādhihi-l-laylah wa sharri mā baʿdahā. Rabbi aʿūdhu bika min al-kasali wa sūʾi-l-kibar. Rabbi aʿūdhu bika min ʿadhābin fī-n-nār wa ʿadhābin fī-l-qabr.",
    "reference": "Sahih Muslim 4/2088",
    "count": "1",
    "description": "Recite in the evening for nightly protection",
    "benefits": "Protection from evil throughout the night"
  },
  {
    "id": 3,
    "category": "Morning Azkar",
    "categoryArabic": "أذكار الصباح",
    "zikr": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "translation": "In the Name of Allah with Whose Name there is protection against every kind of harm in the earth or in the heaven, and He is the All-Hearing and All-Knowing.",
    "transliteration": "Bismillahil-ladhi la yadurru ma'as-mihi shai'un fil-ardi wa la fis-sama'i, wa Huwas-Sami'ul-'Alim.",
    "reference": "Sunan Abu Dawud 5088, At-Tirmidhi 3388, Riyad as-Salihin 1457",
    "count": "3",
    "description": "Protection dua for morning - recite 3 times",
    "benefits": "The Prophet ﷺ said: Nothing will harm the one who recites this three times in morning and evening"
  },
  {
    "id": 4,
    "category": "Evening Azkar",
    "categoryArabic": "أذكار المساء",
    "zikr": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "translation": "In the Name of Allah with Whose Name there is protection against every kind of harm in the earth or in the heaven, and He is the All-Hearing and All-Knowing.",
    "transliteration": "Bismillahil-ladhi la yadurru ma'as-mihi shai'un fil-ardi wa la fis-sama'i, wa Huwas-Sami'ul-'Alim.",
    "reference": "Sunan Abu Dawud 5088, At-Tirmidhi 3388, Riyad as-Salihin 1457",
    "count": "3",
    "description": "Protection dua for evening - recite 3 times",
    "benefits": "The Prophet ﷺ said: Nothing will harm the one who recites this three times in morning and evening"
  },
  {
    "id": 5,
    "category": "Seeking Forgiveness",
    "categoryArabic": "الاستغفار",
    "zikr": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "translation": "O Allah, You are my Lord. There is none worthy of worship besides You. You have created me and I am Your servant. I abide by Your covenant and promise to the best of my ability. I seek refuge in You from the evil I have done. I acknowledge Your bounties upon me, and I confess to my sins. Therefore, forgive me! Surely, none forgives sins except You.",
    "transliteration": "Allahumma anta rabbi la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udhu bika min sharri ma sana'tu, abu'u laka bi ni'matika 'alayya wa abu'u bi dhanbi, faghfir li fa innahu la yaghfirudh-dhunuba illa anta.",
    "reference": "Sahih al-Bukhari 6306",
    "count": "1",
    "description": "Sayyidul Istighfar - The Master of Seeking Forgiveness",
    "benefits": "Whoever recites it in the morning with firm faith and dies that day will enter Paradise. Same for evening recitation"
  },
  {
    "id": 6,
    "category": "Morning Azkar",
    "categoryArabic": "أذكار الصباح",
    "zikr": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
    "transliteration": "Allahu la ilaha illa Huwa, Al-Hayyul-Qayyum. La ta'khudhuhu sinatun wa la nawm. Lahu ma fis-samawati wa ma fil-ard. Man dhalladhi yashfa'u 'indahu illa bi-idhnih. Ya'lamu ma bayna aydihim wa ma khalfahum, wa la yuhituna bi shai'im min 'ilmihi illa bima sha'. Wasi'a Kursiyyuhus-samawati wal-ard, wa la ya'uduhu hifdhuhuma, wa Huwal-'Aliyyul-'Azim.",
    "reference": "Quran 2:255, Sahih al-Bukhari, Sahih Muslim",
    "count": "1",
    "description": "Ayatul Kursi - The greatest verse in the Quran",
    "benefits": "Protection from Shaytan until morning when recited before sleep. Guardian angel appointed for protection throughout the day"
  },
  {
    "id": 7,
    "category": "Evening Azkar",
    "categoryArabic": "أذكار المساء",
    "zikr": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
    "transliteration": "Allahu la ilaha illa Huwa, Al-Hayyul-Qayyum. La ta'khudhuhu sinatun wa la nawm. Lahu ma fis-samawati wa ma fil-ard. Man dhalladhi yashfa'u 'indahu illa bi-idhnih. Ya'lamu ma bayna aydihim wa ma khalfahum, wa la yuhituna bi shai'im min 'ilmihi illa bima sha'. Wasi'a Kursiyyuhus-samawati wal-ard, wa la ya'uduhu hifdhuhuma, wa Huwal-'Aliyyul-'Azim.",
    "reference": "Quran 2:255, Sahih al-Bukhari, Sahih Muslim",
    "count": "1",
    "description": "Ayatul Kursi - The greatest verse in the Quran",
    "benefits": "Protection from Shaytan throughout the night. Divine protection until morning"
  },
  {
    "id": 8,
    "category": "Morning Azkar",
    "categoryArabic": "أذكار الصباح",
    "zikr": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    "translation": "Glory be to Allah and praise be to Him.",
    "transliteration": "Subhan Allah wa bihamdihi.",
    "reference": "Sahih al-Bukhari, Sahih Muslim",
    "count": "100",
    "description": "Recite 100 times in the morning",
    "benefits": "The Prophet ﷺ said: Whoever says this 100 times a day, will be forgiven all his sins even if they were as much as the foam of the sea"
  },
  {
    "id": 9,
    "category": "Travel",
    "categoryArabic": "دعاء السفر",
    "zikr": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ . وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
    "translation": "Glory to Him who has subjected these to our use, for we could never have accomplished this by ourselves, and to our Lord, surely, we are to return.",
    "transliteration": "Subhana alladhi sakhkhara lana hadha wa ma kunna lahu muqrinin, wa inna ila rabbina lamunqalibun.",
    "reference": "Quran 43:13-14, Sahih Muslim 1342, Sunan Abu Dawud 2599, At-Tirmidhi 3446",
    "count": "1",
    "description": "Recite when boarding any vehicle or beginning travel",
    "benefits": "Protection during travel, acknowledgment of Allah's bounty"
  },
  {
    "id": 10,
    "category": "Anxiety & Distress",
    "categoryArabic": "دعاء الهم والحزن",
    "zikr": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
    "translation": "O Allah, I seek refuge in You from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts and from being overpowered by men.",
    "transliteration": "Allahumma inni a'udhu bika min al-hammi wal-hazan, wal-'ajzi wal-kasal, wal-bukhli wal-jubn, wa dala'id-dayni wa ghalabatir-rijal.",
    "reference": "Sahih al-Bukhari 7/158",
    "count": "",
    "description": "For anxiety, worry and distress",
    "benefits": "Relief from worry, sadness, weakness and debts"
  },
  {
    "id": 11,
    "category": "Anxiety & Distress",
    "categoryArabic": "دعاء الهم والحزن",
    "zikr": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ",
    "translation": "O Ever-Living, O Self-Sustaining, by Your mercy I seek help.",
    "transliteration": "Ya Hayyu Ya Qayyum bi-rahmatika astaghith.",
    "reference": "At-Tirmidhi 3524",
    "count": "",
    "description": "For distress and seeking immediate relief",
    "benefits": "Help during difficult times, relief from distress"
  },
  {
    "id": 12,
    "category": "Anxiety & Distress",
    "categoryArabic": "دعاء الكرب",
    "zikr": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "translation": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.",
    "transliteration": "La ilaha illa anta subhanaka inni kuntu minaz-zalimin.",
    "reference": "Quran 21:87, At-Tirmidhi 3505",
    "count": "",
    "description": "Dua of Prophet Yunus (AS) - for severe distress",
    "benefits": "The Prophet ﷺ said: The supplication of Dhun-Nun which he made in the belly of the fish. No Muslim ever prays with it but Allah responds to him"
  },
  {
    "id": 13,
    "category": "Before Sleep",
    "categoryArabic": "أذكار النوم",
    "zikr": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
    "translation": "In Your name O Allah, I die and I live.",
    "transliteration": "Bismika Allahumma amutu wa ahya.",
    "reference": "Sahih al-Bukhari",
    "count": "1",
    "description": "When going to sleep",
    "benefits": "Protection while sleeping, acknowledgment of Allah's control over life and death"
  },
  {
    "id": 14,
    "category": "Upon Waking",
    "categoryArabic": "دعاء الاستيقاظ",
    "zikr": "الْحَمْدُ للَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "translation": "All praise is for Allah who gave us life after having taken it from us and unto Him is the resurrection.",
    "transliteration": "Alhamdu lillahil-ladhi ahyana ba'da ma amatana wa ilayhin-nushur.",
    "reference": "Sahih al-Bukhari",
    "count": "1",
    "description": "Upon waking up from sleep",
    "benefits": "Gratitude for new day and life"
  },
  {
    "id": 15,
    "category": "After Adhan",
    "categoryArabic": "دعاء الآذان",
    "zikr": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاَةِ الْقَائِمَةِ آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَاماً مَحْمُوداً الَّذِي وَعَدْتَهُ",
    "translation": "O Allah, Owner of this perfect call and Owner of this prayer to be performed, grant Muhammad al-waseelah and al-fadeelah and raise him up to a praised station which You have promised him.",
    "transliteration": "Allahumma rabba hadhihid-da'watit-tammah, was-salatil-qa'imah, ati Muhammadan al-wasilata wal-fadilah, wab'ath-hu maqaman mahmudanil-ladhi wa'adtah.",
    "reference": "Sahih al-Bukhari 614",
    "count": "1",
    "description": "After the call to prayer (Adhan)",
    "benefits": "The Prophet ﷺ said: Whoever says this after hearing the Adhan, my intercession will be guaranteed for him on the Day of Resurrection"
  },
  {
    "id": 16,
    "category": "Entering Masjid",
    "categoryArabic": "دعاء دخول المسجد",
    "zikr": "أَعُوذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "translation": "I seek refuge in Allah the Mighty, in His Noble Face, and His Eternal Dominion from Satan the accursed.",
    "transliteration": "A'udhu billahil-'azim, wa bi-wajhihil-karim, wa sultanihil-qadim, minash-shaytanir-rajim.",
    "reference": "Sunan Abu Dawud 466",
    "count": "1",
    "description": "Upon entering the mosque",
    "benefits": "The Prophet ﷺ said: When a person recites this, Satan says: He is protected from me for the whole day"
  },
  {
    "id": 17,
    "category": "Leaving Masjid",
    "categoryArabic": "دعاء الخروج من المسجد",
    "zikr": "بِسْمِ اللَّهِ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "translation": "In the name of Allah, and prayers and peace be upon the Messenger of Allah. O Allah, I ask You from Your favour. O Allah, guard me from the accursed devil.",
    "transliteration": "Bismillah, was-salatu was-salamu 'ala rasulillah. Allahumma inni as'aluka min fadlik. Allahumma-'simni minash-shaytanir-rajim.",
    "reference": "Sahih Muslim, Ibn Majah 773",
    "count": "1",
    "description": "Upon leaving the mosque",
    "benefits": "Seeking Allah's favour and protection from Shaytan"
  },
  {
    "id": 18,
    "category": "Before Eating",
    "categoryArabic": "دعاء الطعام",
    "zikr": "بِسْمِ اللَّهِ",
    "translation": "In the name of Allah.",
    "transliteration": "Bismillah.",
    "reference": "Sunan Abu Dawud, At-Tirmidhi",
    "count": "1",
    "description": "Before eating or drinking",
    "benefits": "Blessings in food, protection from harm"
  },
  {
    "id": 19,
    "category": "After Eating",
    "categoryArabic": "دعاء الطعام",
    "zikr": "الْحَمْدُ للَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَجَعَلَنَا مُسْلِمِينَ",
    "translation": "All praise is for Allah who fed us and gave us drink, and made us Muslims.",
    "transliteration": "Alhamdu lillahil-ladhi at'amana wa saqana, wa ja'alana muslimin.",
    "reference": "Sunan Abu Dawud 3850, At-Tirmidhi 3457",
    "count": "1",
    "description": "After eating or drinking",
    "benefits": "Gratitude for sustenance and Islam"
  },
  {
    "id": 20,
    "category": "Gratitude & Praise",
    "categoryArabic": "الشكر والحمد",
    "zikr": "الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ",
    "translation": "All praise is due to Allah by Whose favor good things are perfected.",
    "transliteration": "Alhamdu lillahil-ladhi bi ni'matihi tatimmus-salihat.",
    "reference": "Sahih Ibn Majah 3803",
    "count": "",
    "description": "When receiving good news or blessing",
    "benefits": "Gratitude for blessings, increased blessings"
  },
  {
    "id": 21,
    "category": "Protection & Refuge",
    "categoryArabic": "الاستعاذة",
    "zikr": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "translation": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
    "transliteration": "A'udhu bi-kalimatillahit-tammati min sharri ma khalaq.",
    "reference": "Sahih Muslim 2708",
    "count": "3",
    "description": "General protection from evil, recite 3 times",
    "benefits": "The Prophet ﷺ said: Nothing will harm him who says this three times in the evening"
  },
  {
    "id": 22,
    "category": "Morning Azkar",
    "categoryArabic": "أذكار الصباح",
    "zikr": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا",
    "translation": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad as my Prophet.",
    "transliteration": "Raditu billahi rabban, wa bil-islami dinan, wa bi-Muhammadin nabiyyan.",
    "reference": "Sunan Abu Dawud 4/318, At-Tirmidhi 3389",
    "count": "3",
    "description": "Recite 3 times in the morning",
    "benefits": "The Prophet ﷺ said: Paradise becomes obligatory for whoever says this three times"
  },
  {
    "id": 23,
    "category": "Evening Azkar",
    "categoryArabic": "أذكار المساء",
    "zikr": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا",
    "translation": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad as my Prophet.",
    "transliteration": "Raditu billahi rabban, wa bil-islami dinan, wa bi-Muhammadin nabiyyan.",
    "reference": "Sunan Abu Dawud 4/318, At-Tirmidhi 3389",
    "count": "3",
    "description": "Recite 3 times in the evening",
    "benefits": "The Prophet ﷺ said: Paradise becomes obligatory for whoever says this three times"
  },
  {
    "id": 24,
    "category": "Seeking Guidance",
    "categoryArabic": "طلب الهداية",
    "zikr": "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، إِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
    "translation": "O Allah, guide me among those You have guided, pardon me among those You have pardoned, befriend me among those You have befriended, bless me in what You have granted, and save me from the evil that You have decreed. Indeed, You decree, and none can pass decree upon You. He whom You support can never be humiliated. Blessed and Exalted are You, our Lord.",
    "transliteration": "Allahumma-hdini fiman hadayt, wa 'afini fiman 'afayt, wa tawallani fiman tawallayt, wa barik li fima a'tayt, wa qini sharra ma qadayt, innaka taqdi wa la yuqda 'alayk, innahu la yadhillu man walayt, tabarakta rabbana wa ta'alayt.",
    "reference": "Sunan Abu Dawud 1425, At-Tirmidhi 464, An-Nasa'i 1746",
    "count": "1",
    "description": "Dua Al-Qunut in Witr prayer, for guidance and protection",
    "benefits": "Comprehensive supplication for guidance, health, and protection"
  },
  {
    "id": 25,
    "category": "General Supplications",
    "categoryArabic": "الدعاء العام",
    "zikr": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "translation": "Our Lord, give us in this world that which is good and in the Hereafter that which is good and protect us from the punishment of the Fire.",
    "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina 'adhaban-nar.",
    "reference": "Quran 2:201, Sahih al-Bukhari 4522, Sahih Muslim 2688",
    "count": "",
    "description": "Comprehensive dua for this life and the Hereafter",
    "benefits": "Most frequently recited dua by the Prophet ﷺ. Includes goodness of both worlds"
  },
  {
    "id": 26,
    "category": "Protection & Refuge",
    "categoryArabic": "المعوذات",
    "zikr": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    "translation": "Say: I seek refuge in the Lord of daybreak, from the evil of that which He created, and from the evil of darkness when it settles, and from the evil of the blowers in knots, and from the evil of an envier when he envies.",
    "transliteration": "Qul a'udhu bi-rabbil-falaq, min sharri ma khalaq, wa min sharri ghasiqin idha waqab, wa min sharrin-naffathati fil-'uqad, wa min sharri hasidin idha hasad.",
    "reference": "Quran 113:1-5, Sunan Abu Dawud 5082",
    "count": "3",
    "description": "Surah Al-Falaq - recite 3 times morning and evening",
    "benefits": "Protection from evil, magic, envy and harm"
  },
  {
    "id": 27,
    "category": "Protection & Refuge",
    "categoryArabic": "المعوذات",
    "zikr": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَٰهِ النَّاسِ، مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ، مِنَ الْجِنَّةِ وَالنَّاسِ",
    "translation": "Say: I seek refuge in the Lord of mankind, the Sovereign of mankind, the God of mankind, from the evil of the retreating whisperer who whispers into the hearts of mankind, from among the jinn and mankind.",
    "transliteration": "Qul a'udhu bi-rabbin-nas, malikin-nas, ilahin-nas, min sharril-waswasil-khannas, alladhi yuwaswisu fi sudurin-nas, minal-jinnati wan-nas.",
    "reference": "Quran 114:1-6, Sunan Abu Dawud 5082",
    "count": "3",
    "description": "Surah An-Nas - recite 3 times morning and evening",
    "benefits": "Protection from whispers of Shaytan and evil thoughts"
  },
  {
    "id": 28,
    "category": "Before Sleep",
    "categoryArabic": "أذكار النوم",
    "zikr": "قُلْ هُوَ اللَّهُ أَحَدٌ، اللَّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ",
    "translation": "Say: He is Allah, the One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent.",
    "transliteration": "Qul huwa Allahu ahad, Allahu samad, lam yalid wa lam yulad, wa lam yakun lahu kufuwan ahad.",
    "reference": "Quran 112:1-4, Sahih al-Bukhari 5017",
    "count": "3",
    "description": "Surah Al-Ikhlas - recite 3 times before sleep",
    "benefits": "The Prophet ﷺ said: It is equivalent to one-third of the Quran. Protection during sleep"
  },
  {
    "id": 29,
    "category": "For the Deceased",
    "categoryArabic": "الدعاء للميت",
    "zikr": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا",
    "translation": "Truly we belong to Allah, and truly to Him we shall return. O Allah, reward me in this affliction and replace it for me with something better.",
    "transliteration": "Inna lillahi wa inna ilayhi raji'un. Allahumma' jurni fi musibati wa akhlif li khayran minha.",
    "reference": "Quran 2:156, Sahih Muslim 918",
    "count": "",
    "description": "Upon hearing of someone's death or facing calamity",
    "benefits": "Patience, acceptance and divine compensation for loss"
  },
  {
    "id": 30,
    "category": "Rain & Thunder",
    "categoryArabic": "دعاء المطر والرعد",
    "zikr": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ",
    "translation": "Glory be to Him whom thunder glorifies with His praise, and the angels too, out of fear of Him.",
    "transliteration": "Subhanal-ladhi yusabbihur-ra'du bi-hamdihi wal-mala'ikatu min khifatih.",
    "reference": "Al-Muwatta 1809, authenticated by Al-Albani",
    "count": "",
    "description": "When hearing thunder",
    "benefits": "Protection from lightning and thunder"
  }
]
