[
  {
    "id": 1,
    "category": "Upon Waking",
    "categoryArabic": "عند الاستيقاظ من النوم",
    "zikr": "الْحَمْدُ للَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "translation": "All praise is for Allah who gave us life after having taken it from us and unto Him is the resurrection.",
    "transliteration": "Alhamdu lillahil-ladhi ahyana ba'da ma amatana wa ilayhin-nushur.",
    "reference": "Sahih al-Bukhari 6312",
    "count": "1",
    "description": "First dua upon waking up from sleep",
    "benefits": "Gratitude for life and acknowledging the Day of Resurrection"
  },
  {
    "id": 2,
    "category": "Wearing Clothes",
    "categoryArabic": "عند لبس الثوب",
    "zikr": "الْحَمْدُ للَّهِ الَّذِي كَسَانِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
    "translation": "All praise is for Allah who has clothed me with this garment and provided it for me, with no power or might from myself.",
    "transliteration": "Alhamdu lillahil-ladhi kasani hadha wa razaqanihi min ghayri hawlin minni wa la quwwah.",
    "reference": "Abu Dawud 4/41, At-Tirmidhi 5/504",
    "count": "1",
    "description": "When putting on clothes",
    "benefits": "Past sins are forgiven"
  },
  {
    "id": 3,
    "category": "Wearing New Clothes",
    "categoryArabic": "عند لبس الثوب الجديد",
    "zikr": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
    "translation": "O Allah, for You is all praise, You have clothed me with it. I ask You for its goodness and the goodness of what it was made for, and I seek refuge with You from the evil of it and the evil of what it was made for.",
    "transliteration": "Allahumma lakal-hamdu anta kasawtanihi, as'aluka min khayrihi wa khayri ma suni'a lahu, wa a'udhu bika min sharrihi wa sharri ma suni'a lahu.",
    "reference": "Abu Dawud 4020, At-Tirmidhi 1767",
    "count": "1",
    "description": "When wearing new clothes",
    "benefits": "Seeking goodness and protection from any harm related to the garment"
  },
  {
    "id": 4,
    "category": "Before Entering Toilet",
    "categoryArabic": "دعاء دخول الخلاء",
    "zikr": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
    "translation": "O Allah, I seek refuge with You from all evil and evil-doers (or male and female devils).",
    "transliteration": "Allahumma inni a'udhu bika minal-khubthi wal-khaba'ith.",
    "reference": "Sahih al-Bukhari 142, Sahih Muslim 375",
    "count": "1",
    "description": "When entering the toilet/bathroom",
    "benefits": "Protection from evil spirits and jinn"
  },
  {
    "id": 5,
    "category": "After Leaving Toilet",
    "categoryArabic": "دعاء الخروج من الخلاء",
    "zikr": "غُفْرَانَكَ",
    "translation": "I ask You for Your forgiveness.",
    "transliteration": "Ghufranaka.",
    "reference": "Abu Dawud 30, At-Tirmidhi 7, Ibn Majah 300",
    "count": "1",
    "description": "When leaving the toilet/bathroom",
    "benefits": "Seeking Allah's forgiveness"
  },
  {
    "id": 6,
    "category": "Before Ablution",
    "categoryArabic": "عند بدء الوضوء",
    "zikr": "بِسْمِ اللَّهِ",
    "translation": "In the name of Allah.",
    "transliteration": "Bismillah.",
    "reference": "Abu Dawud, Ibn Majah",
    "count": "1",
    "description": "When beginning ablution (wudu)",
    "benefits": "Blessings in the act of purification"
  },
  {
    "id": 7,
    "category": "After Ablution",
    "categoryArabic": "بعد الفراغ من الوضوء",
    "zikr": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
    "translation": "I bear witness that none has the right to be worshipped except Allah, alone without partner, and I bear witness that Muhammad is His slave and Messenger.",
    "transliteration": "Ashhadu an la ilaha illallahu wahdahu la sharika lah, wa ashhadu anna Muhammadan 'abduhu wa rasuluh.",
    "reference": "Sahih Muslim 234",
    "count": "1",
    "description": "After completing ablution",
    "benefits": "The eight gates of Paradise are opened, enter from whichever you wish"
  },
  {
    "id": 8,
    "category": "Leaving Home",
    "categoryArabic": "عند الخروج من المنزل",
    "zikr": "بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
    "translation": "In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah.",
    "transliteration": "Bismillah, tawakkaltu 'alallah, wa la hawla wa la quwwata illa billah.",
    "reference": "Abu Dawud 5095, At-Tirmidhi 3426",
    "count": "1",
    "description": "When leaving the house",
    "benefits": "You will be told: You are guided, defended and protected. The devils will go far from you"
  },
  {
    "id": 9,
    "category": "Entering Home",
    "categoryArabic": "دعاء دخول المنزل",
    "zikr": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا",
    "translation": "In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust.",
    "transliteration": "Bismillahi walajna, wa bismillahi kharajna, wa 'alallahi rabbina tawakkalna.",
    "reference": "Abu Dawud 5096",
    "count": "1",
    "description": "When entering the home",
    "benefits": "Protection for the household and keeping Shaytan away"
  },
  {
    "id": 10,
    "category": "Going to Mosque",
    "categoryArabic": "دعاء الذهاب إلى المسجد",
    "zikr": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً، وَفِي لِسَانِي نُوراً، وَاجْعَلْ فِي سَمْعِي نُوراً، وَاجْعَلْ فِي بَصَرِي نُوراً، وَاجْعَلْ مِنْ خَلْفِي نُوراً، وَمِنْ أَمَامِي نُوراً، وَاجْعَلْ مِنْ فَوْقِي نُوراً، وَمِنْ تَحْتِي نُوراً، اللَّهُمَّ أَعْطِنِي نُوراً",
    "translation": "O Allah, place light in my heart, and on my tongue light, and in my ears light and in my sight light, and above me light, and below me light, and to my right light, and to my left light, and before me light and behind me light. Place in my soul light. Magnify for me light, and amplify for me light. Make for me light and make me a light. O Allah, grant me light, and place light in my nerves, and in my body light and in my blood light and in my hair light and in my skin light.",
    "transliteration": "Allahumma-j'al fi qalbi nuran, wa fi lisani nuran, wa-j'al fi sam'i nuran, wa-j'al fi basari nuran, wa-j'al min khalfi nuran, wa min amami nuran, wa-j'al min fawqi nuran, wa min tahti nuran. Allahumma a'tini nuran.",
    "reference": "Sahih al-Bukhari 6316, Sahih Muslim 763",
    "count": "1",
    "description": "When going to the mosque",
    "benefits": "Spiritual light and guidance"
  },
  {
    "id": 11,
    "category": "Entering Masjid",
    "categoryArabic": "دعاء دخول المسجد",
    "zikr": "أَعُوذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "translation": "I seek refuge in Allah the Mighty, in His Noble Face, and His Eternal Dominion from Satan the accursed.",
    "transliteration": "A'udhu billahil-'azim, wa bi-wajhihil-karim, wa sultanihil-qadim, minash-shaytanir-rajim.",
    "reference": "Abu Dawud 466",
    "count": "1",
    "description": "Upon entering the mosque",
    "benefits": "Satan says: He is protected from me for the whole day"
  },
  {
    "id": 12,
    "category": "Leaving Masjid",
    "categoryArabic": "دعاء الخروج من المسجد",
    "zikr": "بِسْمِ اللَّهِ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "translation": "In the name of Allah, and prayers and peace be upon the Messenger of Allah. O Allah, I ask You from Your favour. O Allah, guard me from the accursed devil.",
    "transliteration": "Bismillah, was-salatu was-salamu 'ala rasulillah. Allahumma inni as'aluka min fadlik. Allahumma-'simni minash-shaytanir-rajim.",
    "reference": "Sahih Muslim, Ibn Majah 773",
    "count": "1",
    "description": "Upon leaving the mosque",
    "benefits": "Seeking Allah's favour and protection from Shaytan"
  },
  {
    "id": 13,
    "category": "After Adhan",
    "categoryArabic": "دعاء الآذان",
    "zikr": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاَةِ الْقَائِمَةِ آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَاماً مَحْمُوداً الَّذِي وَعَدْتَهُ",
    "translation": "O Allah, Owner of this perfect call and Owner of this prayer to be performed, grant Muhammad al-waseelah and al-fadeelah and raise him up to a praised station which You have promised him.",
    "transliteration": "Allahumma rabba hadhihid-da'watit-tammah, was-salatil-qa'imah, ati Muhammadan al-wasilata wal-fadilah, wab'ath-hu maqaman mahmudanil-ladhi wa'adtah.",
    "reference": "Sahih al-Bukhari 614",
    "count": "1",
    "description": "After the call to prayer (Adhan)",
    "benefits": "Prophet's intercession guaranteed on Day of Resurrection"
  },
  {
    "id": 14,
    "category": "Opening Prayer",
    "categoryArabic": "دعاء الاستفتاح",
    "zikr": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ",
    "translation": "Glory is to You O Allah, and praise. Blessed is Your Name and Exalted is Your Majesty. There is none worthy of worship except You.",
    "transliteration": "Subhanaka Allahumma wa bihamdika, wa tabarakasmuka, wa ta'ala jadduka, wa la ilaha ghayruk.",
    "reference": "Abu Dawud, Ibn Majah, At-Tirmidhi",
    "count": "1",
    "description": "Opening supplication after starting prayer (after Takbir)",
    "benefits": "Praising Allah at the start of prayer"
  },
  {
    "id": 15,
    "category": "In Ruku (Bowing)",
    "categoryArabic": "دعاء الركوع",
    "zikr": "سُبْحَانَ رَبِّيَ الْعَظِيمِ",
    "translation": "Glory is to my Lord, the Most Great.",
    "transliteration": "Subhana rabbiyal-'azim.",
    "reference": "Abu Dawud, Ibn Majah, An-Nasa'i, At-Tirmidhi",
    "count": "3",
    "description": "While bowing in prayer (minimum 3 times)",
    "benefits": "Glorifying Allah during prayer"
  },
  {
    "id": 16,
    "category": "Rising from Ruku",
    "categoryArabic": "عند الرفع من الركوع",
    "zikr": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ",
    "translation": "Allah hears whoever praises Him.",
    "transliteration": "Sami'allahu liman hamidah.",
    "reference": "Sahih al-Bukhari, Sahih Muslim",
    "count": "1",
    "description": "When rising from bowing position",
    "benefits": "Acknowledging Allah hears our praise"
  },
  {
    "id": 17,
    "category": "Standing After Ruku",
    "categoryArabic": "بعد الرفع من الركوع",
    "zikr": "رَبَّنَا وَلَكَ الْحَمْدُ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ",
    "translation": "Our Lord, to You is all praise, an abundant beautiful blessed praise.",
    "transliteration": "Rabbana wa lakal-hamd, hamdan kathiran tayyiban mubarakan fih.",
    "reference": "Sahih al-Bukhari 799",
    "count": "1",
    "description": "After rising from bowing, while standing",
    "benefits": "Praising Allah abundantly"
  },
  {
    "id": 18,
    "category": "In Sujud (Prostration)",
    "categoryArabic": "دعاء السجود",
    "zikr": "سُبْحَانَ رَبِّيَ الْأَعْلَى",
    "translation": "Glory is to my Lord, the Most High.",
    "transliteration": "Subhana rabbiyal-a'la.",
    "reference": "Abu Dawud, Ibn Majah, An-Nasa'i, At-Tirmidhi",
    "count": "3",
    "description": "While in prostration (minimum 3 times)",
    "benefits": "Glorifying Allah in the humblest position"
  },
  {
    "id": 19,
    "category": "Between Two Prostrations",
    "categoryArabic": "بين السجدتين",
    "zikr": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
    "translation": "My Lord, forgive me. My Lord, forgive me.",
    "transliteration": "Rabbi-ghfir li, Rabbi-ghfir li.",
    "reference": "Abu Dawud, Ibn Majah",
    "count": "2",
    "description": "Between the two prostrations while sitting",
    "benefits": "Seeking forgiveness from Allah"
  },
  {
    "id": 20,
    "category": "Sujud Al-Tilawah",
    "categoryArabic": "سجود التلاوة",
    "zikr": "سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ",
    "translation": "My face has prostrated to the One Who created it, and brought forth its hearing and sight by His might and power.",
    "transliteration": "Sajada wajhi lillathi khalaqahu wa shaqqa sam'ahu wa basarahu bihawlihi wa quwwatihi.",
    "reference": "At-Tirmidhi 3/135, Al-Hakim",
    "count": "1",
    "description": "During prostration of Quran recitation",
    "benefits": "Humility and submission to Allah"
  },
  {
    "id": 21,
    "category": "Tashahhud",
    "categoryArabic": "التشهد",
    "zikr": "التَّحِيَّاتُ للَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
    "translation": "All compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous slaves of Allah. I bear witness that none has the right to be worshipped except Allah, and I bear witness that Muhammad is His slave and Messenger.",
    "transliteration": "At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alayka ayyuhan-nabiyyu wa rahmatullahi wa barakatuh, as-salamu 'alayna wa 'ala 'ibadillahis-salihin, ashhadu an la ilaha illallah, wa ashhadu anna Muhammadan 'abduhu wa rasuluh.",
    "reference": "Sahih al-Bukhari 6328, Sahih Muslim 402",
    "count": "1",
    "description": "Sitting in prayer (Tashahhud)",
    "benefits": "Greeting and blessings upon the Prophet"
  },
  {
    "id": 22,
    "category": "Salawat on Prophet",
    "categoryArabic": "الصلاة على النبي بعد التشهد",
    "zikr": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
    "translation": "O Allah, send prayers upon Muhammad and upon the family of Muhammad, just as You sent prayers upon Ibrahim and upon the family of Ibrahim. Verily, You are full of Praise and Majesty. O Allah, send blessings upon Muhammad and upon the family of Muhammad, just as You sent blessings upon Ibrahim and upon the family of Ibrahim. Verily, You are full of Praise and Majesty.",
    "transliteration": "Allahumma salli 'ala Muhammadin wa 'ala ali Muhammad, kama sallayta 'ala Ibrahima wa 'ala ali Ibrahim, innaka hamidun majid. Allahumma barik 'ala Muhammadin wa 'ala ali Muhammad, kama barakta 'ala Ibrahima wa 'ala ali Ibrahim, innaka hamidun majid.",
    "reference": "Sahih al-Bukhari 3370, Sahih Muslim 406",
    "count": "1",
    "description": "Sending blessings on Prophet after Tashahhud",
    "benefits": "Following the command to send salawat on the Prophet"
  },
  {
    "id": 23,
    "category": "Before Taslim",
    "categoryArabic": "الدعاء قبل السلام من الصلاة",
    "zikr": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
    "translation": "O Allah, I seek refuge in You from the punishment of Hell, from the punishment of the grave, from the trials of life and death, and from the evil of the trial of the False Messiah.",
    "transliteration": "Allahumma inni a'udhu bika min 'adhabi jahannama, wa min 'adhabil-qabr, wa min fitnatil-mahya wal-mamat, wa min sharri fitnatil-masihid-dajjal.",
    "reference": "Sahih al-Bukhari 1377, Sahih Muslim 588",
    "count": "1",
    "description": "Before Salam at end of prayer",
    "benefits": "Seeking Allah's protection from major trials"
  },
  {
    "id": 24,
    "category": "After Salah",
    "categoryArabic": "الأذكار بعد السلام من الصلاة",
    "zikr": "أَسْتَغْفِرُ اللَّهَ، أَسْتَغْفِرُ اللَّهَ، أَسْتَغْفِرُ اللَّهَ، اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
    "translation": "I seek Allah's forgiveness (3 times). O Allah, You are Peace and from You comes peace. Blessed are You, O Owner of majesty and honor.",
    "transliteration": "Astaghfirullah (3x). Allahumma antas-salam wa minkas-salam, tabarakta ya dhal-jalali wal-ikram.",
    "reference": "Sahih Muslim 591",
    "count": "1",
    "description": "Immediately after Salam from prayer",
    "benefits": "Seeking forgiveness and praising Allah"
  },
  {
    "id": 25,
    "category": "After Salah",
    "categoryArabic": "التسبيح بعد الصلاة",
    "zikr": "سُبْحَانَ اللَّهِ، الْحَمْدُ للَّهِ، اللَّهُ أَكْبَرُ",
    "translation": "Glory be to Allah (33 times), All praise is for Allah (33 times), Allah is the Greatest (33 times).",
    "transliteration": "Subhan Allah (33x), Alhamdu lillah (33x), Allahu Akbar (33x).",
    "reference": "Sahih Muslim 596",
    "count": "33 each",
    "description": "Tasbih after each prayer",
    "benefits": "Sins will be forgiven even if they are like the foam of the sea"
  },
  {
    "id": 26,
    "category": "After Salah",
    "categoryArabic": "الأذكار بعد السلام من الصلاة",
    "zikr": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "translation": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent.",
    "transliteration": "La ilaha illallahu wahdahu la sharika lah, lahul-mulku wa lahul-hamd, wa huwa 'ala kulli shay'in qadir.",
    "reference": "Sahih al-Bukhari 844, Sahih Muslim 594",
    "count": "1",
    "description": "After completing 99 Tasbih",
    "benefits": "Completion of 100 remembrances after prayer"
  },
  {
    "id": 27,
    "category": "After Salah",
    "categoryArabic": "الأذكار بعد السلام من الصلاة",
    "zikr": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
    "transliteration": "Allahu la ilaha illa Huwa, Al-Hayyul-Qayyum. La ta'khudhuhu sinatun wa la nawm. Lahu ma fis-samawati wa ma fil-ard. Man dhalladhi yashfa'u 'indahu illa bi-idhnih. Ya'lamu ma bayna aydihim wa ma khalfahum, wa la yuhituna bi shai'im min 'ilmihi illa bima sha'. Wasi'a Kursiyyuhus-samawati wal-ard, wa la ya'uduhu hifdhuhuma, wa Huwal-'Aliyyul-'Azim.",
    "reference": "Quran 2:255, An-Nasa'i",
    "count": "1",
    "description": "Ayatul Kursi after each obligatory prayer",
    "benefits": "Nothing prevents entry into Paradise except death"
  },
  {
    "id": 28,
    "category": "Istikhara",
    "categoryArabic": "صلاة الاستخارة",
    "zikr": "اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِي بِهِ",
    "translation": "O Allah, I seek Your guidance through Your knowledge, and I seek ability through Your power, and I ask You of Your great bounty. You have power; I have none. And You know; I know not. You are the Knower of hidden things. O Allah, if in Your knowledge this matter (mention your need) is good for me in my religion, my livelihood and my affairs, then ordain it for me, make it easy for me, and bless it for me. And if in Your knowledge it is bad for me and for my religion, my livelihood and my affairs, then turn it away from me, and turn me away from it. And ordain for me the good wherever it may be, and make me content with it.",
    "transliteration": "Allahumma inni astakhiruka bi'ilmika, wa astaqdiruka bi-qudratika, wa as'aluka min fadlikal-'azim, fa-innaka taqdiru wa la aqdir, wa ta'lamu wa la a'lam, wa anta 'allamul-ghuyub. Allahumma in kunta ta'lamu anna hadhal-amra khayrun li fi dini wa ma'ashi wa 'aqibati amri faqdurhu li wa yassirhu li thumma barik li fih, wa in kunta ta'lamu anna hadhal-amra sharrun li fi dini wa ma'ashi wa 'aqibati amri fasrifhu 'anni wasrifni 'anhu waqdur liyal-khayra haythu kana thumma ardini bih.",
    "reference": "Sahih al-Bukhari 1162",
    "count": "1",
    "description": "For seeking guidance in decision (pray 2 rakah then make this dua)",
    "benefits": "Seeking Allah's guidance in making important decisions"
  },
  {
    "id": 29,
    "category": "Morning Azkar",
    "categoryArabic": "أذكار الصباح",
    "zikr": "أَصْبَـحْنا وَأَصْبَـحَ المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
    "translation": "We have reached the morning and at this very time all sovereignty belongs to Allah. All praise is for Allah. There is no deity except Allah, the One. He has no partner. To Him belongs sovereignty and all praise. He has power over all things. O Lord, I ask You for the goodness within this day and the goodness after it and I take refuge in You from the evil within this day and the evil after it. O Lord, I take refuge in You from laziness and helplessness. O Lord, I take refuge in You from punishment in the Fire and punishment in the grave.",
    "transliteration": "Aṣbaḥnā wa aṣbaḥa-l-mulku li-llāh, wa-l-ḥamdu li-llāh. Lā ilāha illa-llāh waḥdahu lā sharīka lah. Lahu-l-mulku wa lahu-l-ḥamd, wa huwa ʿalā kulli shayʾin qadīr. Rabbi asʾaluka khayra mā fī hādhā-l-yawm wa khayra mā baʿdah, wa aʿūdhu bika min sharri mā fī hādhā-l-yawm wa sharri mā baʿdah. Rabbi aʿūdhu bika min al-kasali wa sūʾi-l-kibar. Rabbi aʿūdhu bika min ʿadhābin fī-n-nār wa ʿadhābin fī-l-qabr.",
    "reference": "Sahih Muslim 4/2088",
    "count": "1",
    "description": "Morning remembrance",
    "benefits": "Protection from evil throughout the day"
  },
  {
    "id": 30,
    "category": "Evening Azkar",
    "categoryArabic": "أذكار المساء",
    "zikr": "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلَةِ وَشَرِّ ما بَعْـدَهـا، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
    "translation": "We have reached the evening and at this very time all sovereignty belongs to Allah. All praise is for Allah. There is no deity except Allah, the One. He has no partner. To Him belongs sovereignty and all praise. He has power over all things. O Lord, I ask You for the goodness within this night and the goodness after it and I take refuge in You from the evil within this night and the evil after it. O Lord, I take refuge in You from laziness and helplessness. O Lord, I take refuge in You from punishment in the Fire and punishment in the grave.",
    "transliteration": "Amsaynā wa amsā-l-mulku li-llāh, wa-l-ḥamdu li-llāh. Lā ilāha illa-llāh waḥdahu lā sharīka lah. Lahu-l-mulku wa lahu-l-ḥamd, wa huwa ʿalā kulli shayʾin qadīr. Rabbi asʾaluka khayra mā fī hādhihi-l-laylah wa khayra mā baʿdahā, wa aʿūdhu bika min sharri mā fī hādhihi-l-laylah wa sharri mā baʿdahā. Rabbi aʿūdhu bika min al-kasali wa sūʾi-l-kibar. Rabbi aʿūdhu bika min ʿadhābin fī-n-nār wa ʿadhābin fī-l-qabr.",
    "reference": "Sahih Muslim 4/2088",
    "count": "1",
    "description": "Evening remembrance",
    "benefits": "Protection from evil throughout the night"
  },
  {
    "id": 31,
    "category": "Morning Azkar",
    "categoryArabic": "أذكار الصباح",
    "zikr": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "translation": "In the Name of Allah with Whose Name there is protection against every kind of harm in the earth or in the heaven, and He is the All-Hearing and All-Knowing.",
    "transliteration": "Bismillahil-ladhi la yadurru ma'as-mihi shai'un fil-ardi wa la fis-sama'i, wa Huwas-Sami'ul-'Alim.",
    "reference": "Abu Dawud 5088, At-Tirmidhi 3388",
    "count": "3",
    "description": "Protection dua - recite 3 times in morning",
    "benefits": "Nothing will harm the one who recites this 3 times"
  },
  {
    "id": 32,
    "category": "Evening Azkar",
    "categoryArabic": "أذكار المساء",
    "zikr": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "translation": "In the Name of Allah with Whose Name there is protection against every kind of harm in the earth or in the heaven, and He is the All-Hearing and All-Knowing.",
    "transliteration": "Bismillahil-ladhi la yadurru ma'as-mihi shai'un fil-ardi wa la fis-sama'i, wa Huwas-Sami'ul-'Alim.",
    "reference": "Abu Dawud 5088, At-Tirmidhi 3388",
    "count": "3",
    "description": "Protection dua - recite 3 times in evening",
    "benefits": "Nothing will harm the one who recites this 3 times"
  },
  {
    "id": 33,
    "category": "Morning Azkar",
    "categoryArabic": "أذكار الصباح",
    "zikr": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا",
    "translation": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad as my Prophet.",
    "transliteration": "Raditu billahi rabban, wa bil-islami dinan, wa bi-Muhammadin nabiyyan.",
    "reference": "Abu Dawud 1529, At-Tirmidhi 3389",
    "count": "3",
    "description": "Recite 3 times in the morning",
    "benefits": "Paradise becomes obligatory for whoever says this 3 times"
  },
  {
    "id": 34,
    "category": "Evening Azkar",
    "categoryArabic": "أذكار المساء",
    "zikr": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا",
    "translation": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad as my Prophet.",
    "transliteration": "Raditu billahi rabban, wa bil-islami dinan, wa bi-Muhammadin nabiyyan.",
    "reference": "Abu Dawud 1529, At-Tirmidhi 3389",
    "count": "3",
    "description": "Recite 3 times in the evening",
    "benefits": "Paradise becomes obligatory for whoever says this 3 times"
  },
  {
    "id": 35,
    "category": "Morning Azkar",
    "categoryArabic": "أذكار الصباح",
    "zikr": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    "translation": "Glory be to Allah and praise be to Him.",
    "transliteration": "Subhan Allah wa bihamdihi.",
    "reference": "Sahih al-Bukhari, Sahih Muslim",
    "count": "100",
    "description": "Recite 100 times in the morning",
    "benefits": "Sins forgiven even if like the foam of the sea"
  },
  {
    "id": 36,
    "category": "Morning Azkar",
    "categoryArabic": "أذكار الصباح",
    "zikr": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "translation": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent.",
    "transliteration": "La ilaha illallahu wahdahu la sharika lah, lahul-mulku wa lahul-hamd, wa huwa 'ala kulli shay'in qadir.",
    "reference": "Sahih al-Bukhari 6403",
    "count": "10",
    "description": "Recite 10 times in the morning",
    "benefits": "10 good deeds, 10 sins erased, raised 10 degrees, protected from Shaytan"
  },
  {
    "id": 37,
    "category": "Seeking Forgiveness",
    "categoryArabic": "الاستغفار",
    "zikr": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "translation": "O Allah, You are my Lord. There is none worthy of worship besides You. You have created me and I am Your servant. I abide by Your covenant and promise to the best of my ability. I seek refuge in You from the evil I have done. I acknowledge Your bounties upon me, and I confess to my sins. Therefore, forgive me! Surely, none forgives sins except You.",
    "transliteration": "Allahumma anta rabbi la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udhu bika min sharri ma sana'tu, abu'u laka bi ni'matika 'alayya wa abu'u bi dhanbi, faghfir li fa innahu la yaghfirudh-dhunuba illa anta.",
    "reference": "Sahih al-Bukhari 6306",
    "count": "1",
    "description": "Sayyidul Istighfar - Master of Seeking Forgiveness",
    "benefits": "Whoever recites it morning/evening with firm faith and dies enters Paradise"
  },
  {
    "id": 38,
    "category": "Before Sleep",
    "categoryArabic": "أذكار النوم",
    "zikr": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
    "translation": "In Your name O Allah, I die and I live.",
    "transliteration": "Bismika Allahumma amutu wa ahya.",
    "reference": "Sahih al-Bukhari 6312",
    "count": "1",
    "description": "When going to sleep",
    "benefits": "Acknowledging Allah's control over life and death"
  },
  {
    "id": 39,
    "category": "Before Sleep",
    "categoryArabic": "أذكار النوم",
    "zikr": "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
    "translation": "O Allah, protect me from Your punishment on the Day You resurrect Your servants.",
    "transliteration": "Allahumma qini 'adhabaka yawma tab'athu 'ibadak.",
    "reference": "Abu Dawud 5045",
    "count": "3",
    "description": "When placing hand under cheek before sleep",
    "benefits": "Protection from punishment on Day of Judgment"
  },
  {
    "id": 40,
    "category": "Before Sleep",
    "categoryArabic": "أذكار النوم",
    "zikr": "اللَّهُمَّ إِنِّي أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
    "translation": "O Allah, I submit myself to You, entrust my affairs to You, turn my face to You, and lay myself down depending upon You, hoping in You and fearing You. There is no refuge, nor escape, except to You. I believe in Your Book that You revealed, and Your Prophet whom You sent.",
    "transliteration": "Allahumma inni aslamtu nafsi ilayk, wa fawwadtu amri ilayk, wa wajjahtu wajhi ilayk, wa alja'tu zahri ilayk, raghbatan wa rahbatan ilayk, la malja'a wa la manja minka illa ilayk, amantu bikitabikal-ladhi anzalt, wa binabiyyikal-ladhi arsalt.",
    "reference": "Sahih al-Bukhari 247, Sahih Muslim 2710",
    "count": "1",
    "description": "Before sleeping",
    "benefits": "If you die that night, you die upon fitrah (natural state)"
  },
  {
    "id": 41,
    "category": "Before Eating",
    "categoryArabic": "دعاء الطعام",
    "zikr": "بِسْمِ اللَّهِ",
    "translation": "In the name of Allah.",
    "transliteration": "Bismillah.",
    "reference": "Abu Dawud, At-Tirmidhi, Ibn Majah",
    "count": "1",
    "description": "Before eating or drinking",
    "benefits": "Blessings in food and protection from harm"
  },
  {
    "id": 42,
    "category": "After Eating",
    "categoryArabic": "دعاء الطعام",
    "zikr": "الْحَمْدُ للَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَجَعَلَنَا مُسْلِمِينَ",
    "translation": "All praise is for Allah who fed us and gave us drink, and made us Muslims.",
    "transliteration": "Alhamdu lillahil-ladhi at'amana wa saqana, wa ja'alana muslimin.",
    "reference": "Abu Dawud 3850, At-Tirmidhi 3457",
    "count": "1",
    "description": "After eating or drinking",
    "benefits": "Gratitude for sustenance and Islam"
  },
  {
    "id": 43,
    "category": "Travel",
    "categoryArabic": "دعاء السفر",
    "zikr": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
    "translation": "Glory to Him who has subjected these to our use, for we could never have accomplished this by ourselves, and to our Lord, surely, we are to return.",
    "transliteration": "Subhana alladhi sakhkhara lana hadha wa ma kunna lahu muqrinin, wa inna ila rabbina lamunqalibun.",
    "reference": "Quran 43:13-14, Sahih Muslim 1342, At-Tirmidhi 3446",
    "count": "1",
    "description": "When boarding vehicle or beginning travel",
    "benefits": "Protection during travel"
  },
  {
    "id": 44,
    "category": "Travel",
    "categoryArabic": "دعاء السفر",
    "zikr": "اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الْأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ",
    "translation": "O Allah, we ask You in this journey of ours for righteousness and piety, and for deeds that are pleasing to You. O Allah, make this journey easy for us and make its distance short for us. O Allah, You are the Companion in the journey and the Successor over the family. O Allah, I seek refuge with You from the difficulties of travel, from having a change of heart and being in a bad predicament, and I take refuge in You from an ill fated outcome for wealth and family.",
    "transliteration": "Allahumma inna nas'aluka fi safarina hadhal-birra wat-taqwa, wa minal-'amali ma tarda. Allahumma hawwin 'alayna safarana hadha watwi 'anna bu'dah. Allahumma antas-sahibu fis-safar, wal-khalifatu fil-ahl. Allahumma inni a'udhu bika min wa'tha'is-safar, wa ka'abatil-manzar, wa su'il-munqalabi fil-mali wal-ahl.",
    "reference": "Sahih Muslim 1342",
    "count": "1",
    "description": "Complete travel dua",
    "benefits": "Protection and ease during journey"
  },
  {
    "id": 45,
    "category": "Anxiety & Distress",
    "categoryArabic": "دعاء الهم والحزن",
    "zikr": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
    "translation": "O Allah, I seek refuge in You from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts and from being overpowered by men.",
    "transliteration": "Allahumma inni a'udhu bika min al-hammi wal-hazan, wal-'ajzi wal-kasal, wal-bukhli wal-jubn, wa dala'id-dayni wa ghalabatir-rijal.",
    "reference": "Sahih al-Bukhari 6369",
    "count": "",
    "description": "For anxiety, worry and distress",
    "benefits": "Relief from worry, sadness, weakness and debts"
  },
  {
    "id": 46,
    "category": "Anxiety & Distress",
    "categoryArabic": "دعاء الكرب",
    "zikr": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "translation": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.",
    "transliteration": "La ilaha illa anta subhanaka inni kuntu minaz-zalimin.",
    "reference": "Quran 21:87, At-Tirmidhi 3505",
    "count": "",
    "description": "Dua of Prophet Yunus (AS) - for severe distress",
    "benefits": "No Muslim prays with it but Allah responds to him"
  },
  {
    "id": 47,
    "category": "Anxiety & Distress",
    "categoryArabic": "دعاء الكرب",
    "zikr": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ",
    "translation": "O Ever-Living, O Self-Sustaining, by Your mercy I seek help.",
    "transliteration": "Ya Hayyu Ya Qayyum bi-rahmatika astaghith.",
    "reference": "At-Tirmidhi 3524",
    "count": "",
    "description": "For distress and seeking immediate relief",
    "benefits": "Help during difficult times"
  },
  {
    "id": 48,
    "category": "When Visiting Sick",
    "categoryArabic": "دعاء عيادة المريض",
    "zikr": "لَا بَأْسَ، طَهُورٌ إِنْ شَاءَ اللَّهُ",
    "translation": "Do not worry, it will be a purification (for you), Allah willing.",
    "transliteration": "La ba's, tahurun in sha' Allah.",
    "reference": "Sahih al-Bukhari 3616",
    "count": "1",
    "description": "When visiting the sick",
    "benefits": "Comforting the sick person"
  },
  {
    "id": 49,
    "category": "When Sneezing",
    "categoryArabic": "عند العطاس",
    "zikr": "الْحَمْدُ للَّهِ",
    "translation": "All praise is for Allah.",
    "transliteration": "Alhamdu lillah.",
    "reference": "Sahih al-Bukhari 6224",
    "count": "1",
    "description": "What the one who sneezes says",
    "benefits": "Praising Allah"
  },
  {
    "id": 50,
    "category": "When Sneezing",
    "categoryArabic": "الرد على العاطس",
    "zikr": "يَرْحَمُكَ اللَّهُ",
    "translation": "May Allah have mercy upon you.",
    "transliteration": "Yarhamukallah.",
    "reference": "Sahih al-Bukhari 6224",
    "count": "1",
    "description": "Reply to one who sneezes and praises Allah",
    "benefits": "Making dua for the sneezer"
  },
  {
    "id": 51,
    "category": "For Newlyweds",
    "categoryArabic": "دعاء الزواج",
    "zikr": "بَارَكَ اللَّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
    "translation": "May Allah bless you, shower His blessings upon you, and unite you both in goodness.",
    "transliteration": "Baraka Allahu lak, wa baraka 'alayk, wa jama'a baynakuma fi khayr.",
    "reference": "Abu Dawud 2130, At-Tirmidhi 1091",
    "count": "1",
    "description": "Congratulating newly married couple",
    "benefits": "Blessing for the new couple"
  },
  {
    "id": 52,
    "category": "During Rain",
    "categoryArabic": "دعاء المطر",
    "zikr": "اللَّهُمَّ صَيِّباً نَافِعاً",
    "translation": "O Allah, (bring) beneficial rain clouds.",
    "transliteration": "Allahumma sayyiban nafi'an.",
    "reference": "Sahih al-Bukhari 1032",
    "count": "1",
    "description": "When it rains",
    "benefits": "Asking for beneficial rain"
  },
  {
    "id": 53,
    "category": "After Rain",
    "categoryArabic": "بعد المطر",
    "zikr": "مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ",
    "translation": "It has rained by the bounty of Allah and His mercy.",
    "transliteration": "Mutirnabi fadlillahi wa rahmatihi.",
    "reference": "Sahih al-Bukhari 846, Sahih Muslim 71",
    "count": "1",
    "description": "After it rains",
    "benefits": "Acknowledging Allah's mercy"
  },
  {
    "id": 54,
    "category": "Upon Hearing Thunder",
    "categoryArabic": "عند سماع الرعد",
    "zikr": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ",
    "translation": "Glory be to Him whom thunder glorifies with His praise, and the angels too, out of fear of Him.",
    "transliteration": "Subhanal-ladhi yusabbihur-ra'du bi-hamdihi wal-mala'ikatu min khifatih.",
    "reference": "Al-Muwatta 1809, authenticated by Al-Albani",
    "count": "",
    "description": "When hearing thunder",
    "benefits": "Protection from lightning and thunder"
  },
  {
    "id": 55,
    "category": "For the Deceased",
    "categoryArabic": "الدعاء للميت",
    "zikr": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا",
    "translation": "Truly we belong to Allah, and truly to Him we shall return. O Allah, reward me in this affliction and replace it for me with something better.",
    "transliteration": "Inna lillahi wa inna ilayhi raji'un. Allahumma' jurni fi musibati wa akhlif li khayran minha.",
    "reference": "Quran 2:156, Sahih Muslim 918",
    "count": "",
    "description": "Upon hearing of someone's death or facing calamity",
    "benefits": "Patience and divine compensation for loss"
  },
  {
    "id": 56,
    "category": "General Supplications",
    "categoryArabic": "الدعاء العام",
    "zikr": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "translation": "Our Lord, give us in this world that which is good and in the Hereafter that which is good and protect us from the punishment of the Fire.",
    "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina 'adhaban-nar.",
    "reference": "Quran 2:201, Sahih al-Bukhari 4522, Sahih Muslim 2688",
    "count": "",
    "description": "Comprehensive dua for this life and Hereafter",
    "benefits": "Most frequently recited dua by the Prophet ﷺ"
  },
  {
    "id": 57,
    "category": "Protection & Refuge",
    "categoryArabic": "المعوذات",
    "zikr": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    "translation": "Say: I seek refuge in the Lord of daybreak, from the evil of that which He created, and from the evil of darkness when it settles, and from the evil of the blowers in knots, and from the evil of an envier when he envies.",
    "transliteration": "Qul a'udhu bi-rabbil-falaq, min sharri ma khalaq, wa min sharri ghasiqin idha waqab, wa min sharrin-naffathati fil-'uqad, wa min sharri hasidin idha hasad.",
    "reference": "Quran 113:1-5",
    "count": "3",
    "description": "Surah Al-Falaq - recite 3 times morning and evening",
    "benefits": "Protection from evil, magic, envy"
  },
  {
    "id": 58,
    "category": "Protection & Refuge",
    "categoryArabic": "المعوذات",
    "zikr": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَٰهِ النَّاسِ، مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ، مِنَ الْجِنَّةِ وَالنَّاسِ",
    "translation": "Say: I seek refuge in the Lord of mankind, the Sovereign of mankind, the God of mankind, from the evil of the retreating whisperer who whispers into the hearts of mankind, from among the jinn and mankind.",
    "transliteration": "Qul a'udhu bi-rabbin-nas, malikin-nas, ilahin-nas, min sharril-waswasil-khannas, alladhi yuwaswisu fi sudurin-nas, minal-jinnati wan-nas.",
    "reference": "Quran 114:1-6",
    "count": "3",
    "description": "Surah An-Nas - recite 3 times morning and evening",
    "benefits": "Protection from whispers of Shaytan"
  },
  {
    "id": 59,
    "category": "Protection & Refuge",
    "categoryArabic": "المعوذات",
    "zikr": "قُلْ هُوَ اللَّهُ أَحَدٌ، اللَّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ",
    "translation": "Say: He is Allah, the One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent.",
    "transliteration": "Qul huwa Allahu ahad, Allahu samad, lam yalid wa lam yulad, wa lam yakun lahu kufuwan ahad.",
    "reference": "Quran 112:1-4",
    "count": "3",
    "description": "Surah Al-Ikhlas - recite 3 times morning and evening",
    "benefits": "Equivalent to one-third of the Quran"
  },
  {
    "id": 60,
    "category": "Protection & Refuge",
    "categoryArabic": "الاستعاذة",
    "zikr": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "translation": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
    "transliteration": "A'udhu bi-kalimatillahit-tammati min sharri ma khalaq.",
    "reference": "Sahih Muslim 2708",
    "count": "3",
    "description": "General protection from evil - recite 3 times",
    "benefits": "Nothing will harm him who says this 3 times in evening"
  },
  {
    "id": 61,
    "category": "Salawat on the Prophet",
    "categoryArabic": "الصلاة على النبي",
    "zikr": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
    "translation": "O Allah, send prayers upon Muhammad and upon the family of Muhammad, as You sent prayers upon Ibrahim and the family of Ibrahim; You are indeed Worthy of Praise, Full of Glory. O Allah, send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon Ibrahim and the family of Ibrahim; You are indeed Worthy of Praise, Full of Glory.",
    "transliteration": "Allahumma salli 'ala Muhammadin wa 'ala ali Muhammadin, kama sallayta 'ala Ibrahima wa 'ala ali Ibrahima, innaka Hamidun Majid. Allahumma barik 'ala Muhammadin wa 'ala ali Muhammadin, kama barakta 'ala Ibrahima wa 'ala ali Ibrahima, innaka Hamidun Majid.",
    "reference": "Sahih al-Bukhari 6357, Sahih Muslim 406",
    "count": "",
    "description": "Durood Ibrahim - the most complete form of Salawat taught by the Prophet ﷺ",
    "benefits": "This is the salawat recited in every prayer. The Prophet ﷺ taught this when companions asked how to send blessings upon him"
  },
  {
    "id": 62,
    "category": "Salawat on the Prophet",
    "categoryArabic": "الصلاة على النبي",
    "zikr": "مَنْ صَلَّى عَلَيَّ صَلَاةً وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرَ صَلَوَاتٍ وَحُطَّتْ عَنْهُ عَشْرُ خَطِيئَاتٍ وَرُفِعَتْ لَهُ عَشْرُ دَرَجَاتٍ",
    "translation": "Whoever sends salah (blessings) upon me once, Allah will send salah upon him tenfold, and will erase ten sins from him, and will raise him ten degrees in status.",
    "transliteration": "Man salla 'alayya salatan wahidatan salla Allahu 'alayhi 'ashara salawatin wa huttat 'anhu 'ashr khati'atin wa rufi'at lahu 'ashr darajat.",
    "reference": "Sunan an-Nasa'i 1297, Sahih Muslim 384",
    "count": "",
    "description": "The immense reward for sending one salawat upon the Prophet ﷺ",
    "benefits": "For each salawat: Allah sends 10 blessings, 10 sins erased, elevated 10 degrees. Authenticated as Sahih"
  },
  {
    "id": 63,
    "category": "Salawat on the Prophet",
    "categoryArabic": "الصلاة على النبي",
    "zikr": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ",
    "translation": "O Allah, send prayers upon Muhammad.",
    "transliteration": "Allahumma salli 'ala Muhammad.",
    "reference": "Authentic - minimum form of Salawat",
    "count": "",
    "description": "The shortest and simplest form of sending blessings upon the Prophet ﷺ",
    "benefits": "Quick to recite, can be said frequently throughout the day. Fulfills the command in Quran 33:56"
  },
  {
    "id": 64,
    "category": "Salawat on the Prophet",
    "categoryArabic": "الصلاة على النبي",
    "zikr": "قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ جَعَلْتُ صَلاَتِي كُلَّهَا عَلَيْكَ قَالَ إِذًا تُكْفَى هَمَّكَ وَيُغْفَرُ لَكَ ذَنْبُكَ",
    "translation": "I (Ubayy ibn Ka'b) said: O Messenger of Allah, what if I make all of my supplication for sending blessings upon you? He said: Then your concerns will be taken care of and your sins will be forgiven.",
    "transliteration": "Qultu ya Rasula Allah ara'ayta in ja'altu salati kullaha 'alayka qala idhan tukfa hammaka wa yughfar laka dhanbuk.",
    "reference": "Sunan at-Tirmidhi 2457, authenticated as Hasan by at-Tirmidhi and Sahih by al-Albani",
    "count": "",
    "description": "The virtue of dedicating one's supplications to sending blessings on the Prophet ﷺ",
    "benefits": "Allah will take care of all worldly and afterlife concerns and forgive sins. Authenticated as Sahih by Sheikh al-Albani"
  },
  {
    "id": 65,
    "category": "Salawat on the Prophet",
    "categoryArabic": "الصلاة على النبي",
    "zikr": "أَوْلَى النَّاسِ بِي يَوْمَ الْقِيَامَةِ أَكْثَرُهُمْ عَلَيَّ صَلاَةً",
    "translation": "The closest of people to me on the Day of Resurrection will be those who send the most blessings upon me.",
    "transliteration": "Awla an-nasi bi yawma al-qiyamati aktharuhum 'alayya salatan.",
    "reference": "Sunan at-Tirmidhi 484, authenticated as Hasan by at-Tirmidhi",
    "count": "",
    "description": "The Prophet ﷺ describing who will be closest to him on the Day of Judgment",
    "benefits": "Closeness to the Prophet ﷺ on the Day of Resurrection by frequently sending salawat"
  },
  {
    "id": 66,
    "category": "Salawat on the Prophet",
    "categoryArabic": "الصلاة على النبي",
    "zikr": "الدُّعَاءُ مَوْقُوفٌ بَيْنَ السَّمَاءِ وَالأَرْضِ لاَ يَصْعَدُ مِنْهُ شَيْءٌ حَتَّى تُصَلِّيَ عَلَى نَبِيِّكَ",
    "translation": "The supplication is suspended between heaven and earth, and none of it ascends until you send blessings upon your Prophet.",
    "transliteration": "Ad-du'a mawqufun bayna as-sama'i wal-ardi la yas'adu minhu shay'un hatta tusalliya 'ala nabiyyik.",
    "reference": "Sunan at-Tirmidhi 486, authenticated as Hasan by al-Albani",
    "count": "",
    "description": "Statement of Umar ibn al-Khattab (may Allah be pleased with him) about salawat before dua",
    "benefits": "Sending salawat on the Prophet ﷺ before making dua helps the dua to be accepted"
  },
  {
    "id": 67,
    "category": "Salawat on the Prophet",
    "categoryArabic": "الصلاة على النبي",
    "zikr": "إِذَا دَعَا أَحَدُكُمْ فَلْيَبْدَأْ بِتَحْمِيدِ اللَّهِ وَالثَّنَاءِ عَلَيْهِ ثُمَّ لْيُصَلِّ عَلَى النَّبِيِّ ثُمَّ لْيَدْعُ بَمَا شَاءَ",
    "translation": "When any one of you prays, let him begin by praising Allah and extolling Him, then let him send blessings upon the Prophet, then let him ask for whatever he wants.",
    "transliteration": "Idha da'a ahadukum falyabda' bi-tahmidi Allahi wa ath-thana'i 'alayhi thumma li-yusalli 'ala an-nabiyyi thumma li-yad'u bima sha'.",
    "reference": "Sunan at-Tirmidhi 3477, Sunan Abi Dawud 1481, authenticated as Sahih by al-Albani",
    "count": "",
    "description": "The proper order of making dua: praise Allah, send salawat, then ask",
    "benefits": "Following this order makes the dua more likely to be accepted"
  },
  {
    "id": 68,
    "category": "Salawat on the Prophet",
    "categoryArabic": "الصلاة على النبي",
    "zikr": "صَلُّوا عَلَيَّ فَإِنَّ صَلاَتَكُمْ عَلَيَّ زَكَاةٌ لَكُمْ",
    "translation": "Send blessings upon me, for indeed your blessings upon me are purification for you.",
    "transliteration": "Sallu 'alayya fa-inna salatakum 'alayya zakatun lakum.",
    "reference": "Musnad Ahmad 15570, authenticated by scholars",
    "count": "",
    "description": "The purifying effect of sending salawat upon the Prophet ﷺ",
    "benefits": "Sending salawat purifies the soul and increases spiritual rank"
  },
  {
    "id": 69,
    "category": "Salawat on the Prophet",
    "categoryArabic": "الصلاة على النبي - يوم الجمعة",
    "zikr": "أَكْثِرُوا الصَّلاَةَ عَلَيَّ يَوْمَ الْجُمُعَةِ وَلَيْلَةَ الْجُمُعَةِ فَمَنْ صَلَّى عَلَيَّ صَلاَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا",
    "translation": "Send blessings upon me abundantly on Friday and the night of Friday, for whoever sends blessings upon me once, Allah will send blessings upon him ten times.",
    "transliteration": "Akthiru as-salata 'alayya yawma al-jumu'ati wa laylata al-jumu'ati fa-man salla 'alayya salatan salla Allahu 'alayhi 'ashran.",
    "reference": "Sunan al-Bayhaqi, authenticated as Hasan by al-Albani in Sahih al-Jami 1209",
    "count": "",
    "description": "The special emphasis on sending abundant salawat on Friday",
    "benefits": "Multiplied reward on Friday. Allah sends 10 blessings for each salawat sent on the Prophet ﷺ"
  }
]
